Tekla.Structures.ModelInternal.BentPlate
A class for the bent plate
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
using Tekla.Structures.ModelInternal;
public class Example
{
private ContourPlate CreateContourPlate(Point point1, Point point2, Point point3)
{
ContourPoint contourPoint1 =  new ContourPoint(point1, null);
ContourPoint contourPoint2 = new ContourPoint(point2, null);
ContourPoint contourPoint3 = new ContourPoint(point3, null);
ContourPlate CP = new ContourPlate();
CP.AddContourPoint(contourPoint1);
CP.AddContourPoint(contourPoint2);
CP.AddContourPoint(contourPoint3);
CP.Finish = "FOO";
CP.Profile.ProfileString = "PL200";
CP.Material.MaterialString = "Steel_Undefined";
CP.Insert();
return CP;
}
public void Example1()
{
Point point1 = new Point(0, 4000, 1000);
Point point2 = new Point(2000, 4000, 1000);
Point point3 = new Point(0, 6000, 3000);
Point point4 = new Point(0, 0, 0);
Point point5 = new Point(0, 2000, 0);
Point point6 = new Point(2000, 2000, 0);
Part contourPlate1 = CreateContourPlate(point1, point2, point3);
Part contourPlate2 = CreateContourPlate(point4, point5, point6);
BentPlate bentPlate = BentPlate.CreateByParts(contourPlate1, contourPlate2);
}
}